Revit 2026 API

# SubelementCanHaveTypeAssigned Method

---

Identifies if the subelement can have a type assigned.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanHaveTypeAssigned()
```
```vb
Public Function CanHaveTypeAssigned As Boolean
```
```cpp
public:
bool CanHaveTypeAssigned()
```
```fsharp
member CanHaveTypeAssigned : unit -> bool
```

#### Return Value

Boolean True if subelement can have a type assigned, false otherwise.

Some subelements cannot have type assigned, in which case invalid element id is considered to be their type id.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace